Tekla Open API Reference for Tekla Structures 2025
Component Properties
The Component type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the component. The name identifies custom components or plug-ins.
 (Inherited from BaseComponent.)
Number
 The number of the component. A number greater than zero identifies system components, for custom components the number is CUSTOM_OBJECT_NUMBER, and for plug-ins the number is PLUGIN_OBJECT_NUMBER.
 (Inherited from BaseComponent.)
Top
See Also
Reference
Component Class
Tekla.Structures.Model Namespace